## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.archive_form_templates will be updated in-place
  ~ resource "aws_lambda_function" "archive_form_templates" {
        id                             = "ArchiveFormTemplates"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:98",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:107",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:98",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:107",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.reliability_lib must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:98" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-01-09T15:46:32.015+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:98" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "wHJBCj8/2523hfxjt4gx63jZ8Dz9x4sf0KwOHRmy6J4=" -> "yX/KBb7tPOsAOyavYcVk1wPHJZEfC7wxUjrDxYlAYwU=" # forces replacement
      ~ source_code_size            = 8123 -> (known after apply)
      ~ version                     = "98" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:107" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-01-09T15:46:36.840+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:107" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "ZuPk+b8FZgAo1pzxSg8pKdEvrenB/t2ONBTuzUbzgi8=" -> "dgQAc5KBw3E0SGt9eCd//VTLxKD3S5x3gfFsDKA2Iao=" # forces replacement
      ~ source_code_size            = 5500938 -> (known after apply)
      ~ version                     = "107" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_cloudwatch_metric_alarm.scan_files_api_error[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_role.s3_scan_object"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
